[[{"que": [["span", "How many types of cracks can occur in a building?"]], "options": [[["span", "3"]], [["span", "4"]], [["span", "2"]], [["span", "6"]]], "ans": "C", "explanation": "\nNon-moving and Moving are two types of cracks in buildings. Non-moving cracks are usually shallow and are the result of shrinkage. Moving crack are wider and are caused due to excessive stress in concrete.\n"}, {"que": [["span", "Creep in concrete structure increases with:"]], "options": [[["span", "Increase in humidity"]], [["span", "Increase in water"]], [["span", "Decrease in temperature"]], [["span", "Decrease in humidity"]]], "ans": "D", "explanation": "\nCreep is small deformation that formed due to concrete loading which is caused due to increase in temperature and decrease in humidity\n"}, {"que": [["span", " To control corrosion, concrete with _________ is used."]], "options": [[["span", "Low permeability"]], [["span", "Low thermal coefficient"]], [["span", "More cement content"]], [["span", "More coarse aggregates"]]], "ans": "A", "explanation": "\nLess permeability leads to less chance of moisture, chemical absorption which is the factor for corrosion of steel bars.\n"}, {"que": [["span", "The main reason for cracks in masonry joints is:"]], "options": [[["span", "Moisture"]], [["span", "Sulphate"]], [["span", "Magnesium"]], [["span", "Sodium"]]], "ans": "B", "explanation": "\nThe main reason for cracks in masonry joints is Sulphate content. Cracks appear after 2-3 years of construction.\n"}, {"que": [["span", "Shear cracks between the main wall and cross wall can be corrected using:"]], "options": [[["span", "Grouting"]], [["span", "Rebuilding"]], [["span", "Guining"]], [["span", "Toothing"]]], "ans": "D", "explanation": "\nShear cracks appears due to poor bonding between main and cross wall. This can be corrected using toothing.\n"}, {"que": [["span", "Which IS code gives details about termite proofing?"]], "options": [[["span", "IS 6835"]], [["span", "IS 6313"]], [["span", "IS 5886"]], [["span", "IS 5668"]]], "ans": "B", "explanation": "\nIS 6313 part I and II gives detail about termite treatment. Wood, plastic, leather and rubber can be attacked by termite. Anti termite protection is therefore used.\n"}, {"que": [["span", "Leaks in the pitched roof may be caused due to:"]], "options": [[["span", "Improper slopes"]], [["span", "Unfinished roof and wall junction"]], [["span", "Depression on top of roof"]], [["span", "Heavy wind"]]], "ans": "D", "explanation": "\nHeavy wind is the reason for leaks in the pitched roof. Other options are the reason for leaks in flat roof.\n"}, {"que": [["span", "The chemical heptachlor in anti-termite proofing has concentration by weight of:"]], "options": [[["span", "0.50%"]], [["span", "0.10%"]], [["span", "0.30%"]], [["span", "0.20%"]]], "ans": "A", "explanation": "\nHeptachlor in anti-termite proofing has concentration by weight of 0.50%.\n"}, {"que": [["span", "Desiccants are chemicals that:"]], "options": [[["span", "Remove humidity"]], [["span", "Add humidity"]], [["span", "Add moisture"]], [["span", "Remove moisture"]]], "ans": "D", "explanation": "\nDessicants are chemicals that are used to remove moisture from the air.\n"}, {"que": [["span", "In a building, to provide ultimate comfort to occupants ________ can be used."]], "options": [[["span", "AC"]], [["span", "HVAC"]], [["span", "Ventilators"]], [["span", "HAC"]]], "ans": "B", "explanation": "\nHVAC is used in buildings to provide ultimate comfort to occupants. HVAC stands for heating ventilation and air-conditioning.\n"}, {"que": [["span", "Which IS codes gives details about elevators?"]], "options": [[["span", "IS 27752"]], [["span", "IS 38665"]], [["span", "IS 14665"]], [["span", "IS 27855"]]], "ans": "C", "explanation": "\nIS 14665 gives details about elevators. It specifies the number, capacityof elevator and number of floors to be served.\n"}, {"que": [["span", "The slope of a ramp should not be more than:"]], "options": [[["span", "1 in 35"]], [["span", "1 in 20"]], [["span", "1 in 15"]], [["span", "1 in 10"]]], "ans": "C", "explanation": "\nRamps helps in easy passage for elderly and physically challenged occupants. The slope should be 1 in 15.\n"}, {"que": [["span", "How many types of ventilation are there?"]], "options": [[["span", "3"]], [["span", "4"]], [["span", "2"]], [["span", "5"]]], "ans": "A", "explanation": "\nThere are three types of ventilation i.e., natural, mechanical and hybrid or mixed-mode ventilation.\n"}, {"que": [["span", "A fire detector cannot detect:"]], "options": [[["span", "Radiation"]], [["span", "Heat"]], [["span", "Light "]], [["span", "Smoke"]]], "ans": "C", "explanation": "\nA fire detector cannot detect light. It can detect radiation, heat and smoke.\n"}, {"que": [["span", "When exposed to fire, concrete has very little strength left after:"]], "options": [[["span", "500°C"]], [["span", "300°C"]], [["span", "200°C"]], [["span", "600°C"]]], "ans": "D"}, {"que": [["span", "While calculating the handling capacity of lift, the weight of a person is taken as 65kg."]], "options": [[["span", "TRUE"]], [["span", "FALSE"]]], "ans": "B", "explanation": "\nThe weight of a person is taken as 68kg while calculating the handling capacity of the lift.\n"}, {"que": [["span", "DPM stands for:"]], "options": [[["span", "Damp Proof Material"]], [["span", "Damp Proof Mix"]], [["span", "Damp Proof Member "]], [["span", "Damp Proof Membrane"]]], "ans": "D", "explanation": "\nDPM or Damp Proof Membrane is a material applied to prevent dampness. Instead of a DPC(Damp Proof Course), DPM is used.\n"}, {"que": [["span", "If the soil is dry, DPC for ground floor consists of the layer of:"]], "options": [[["span", "Metal"]], [["span", "Coarse Sand"]], [["span", "Fine Sand"]], [["span", "Concrete"]]], "ans": "B", "explanation": "\nDPC for ground floor consists of the layer of coarse sand when the soil is dry. The thickness of the coarse sand is about 75-100mm.\n"}, {"que": [["span", "Dampness spreads upwards from the ground only."]], "options": [[["span", "TRUE"]], [["span", "FALSE"]]], "ans": "B", "explanation": "\nDampness spreads upwards as well as downwards. So the statement is false.\n"}, {"que": [["span", "At roof slab level over the DPC, __________ are provided."]], "options": [[["span", "Tiles"]], [["span", "Concrete"]], [["span", "P.C.C."]], [["span", "Rubber Sheet"]]], "ans": "A", "explanation": "\nTiles are provided at roof slab level over the DPC to reduce the dampness. The treatment involves the treatment of parapet and roof slab.\n"}, {"que": [["span", "DPC materials can be classified into:"]], "options": [[["span", "3"]], [["span", "4"]], [["span", "2"]], [["span", "5"]]], "ans": "A", "explanation": "\nDPC materials can be classified into 3 categories. The categories are flexible materials, semi rigid materials and rigid materials.\n"}, {"que": [["span", "DPC materials should ideally be flexible, where differential thermal movements occur."]], "options": [[["span", "TRUE"]], [["span", "FALSE"]]], "ans": "A", "explanation": "\nFlexible materials are the best. DPC materials should ideally be flexible. Under differential thermal movements flexible material do not crack or puncture.\n"}, {"que": [["span", "Which of the below is an example of semi rigid DPC material?"]], "options": [[["span", "Plastic Sheeting"]], [["span", "Cement Concrete"]], [["span", "Asphalt"]], [["span", "Stone"]]], "ans": "C", "explanation": "\nAsphalt is an example of semi rigid material while plastic sheeting sheeting is flexible material. Cement concrete and stone are examples of rigid materials.\n"}, {"que": [["span", "For DPC at plinth level, which grade of concrete is used?"]], "options": [[["span", "M10"]], [["span", "M20"]], [["span", "M25"]], [["span", "M15"]]], "ans": "D", "explanation": "\nCement concrete of grade M15 (1:2:4) is used at plinth level. The thickness of M15 is about 38-50mm.\n"}, {"que": [["span", "R.C.C. can be classified into:"]], "options": [[["span", "2"]], [["span", "3"]], [["span", "4"]], [["span", "5"]]], "ans": "A", "explanation": "\nRCC(Reinforced cement concrete) can be of two types : pre-cast and casted in-situ.\n"}, {"que": [["span", "PSC stands for:"]], "options": [[["span", "Post-Stressed Concrete"]], [["span", "Post-Strained Concrete"]], [["span", "Pre-Stressed Concrete"]], [["span", "Pre-Strained Concrete"]]], "ans": "C", "explanation": "\nPre-Stressed Concrete is a block of concrete which has been subjected to compression prior to supporting any loads.\n"}, {"que": [["span", "__________ is used to construct very thin, hard and strong surface."]], "options": [[["span", "R.C.C."]], [["span", "PSC"]], [["span", "PCC"]], [["span", "Ferro-Cement"]]], "ans": "D", "explanation": "\nFerro-Cement is used to construct very thin, hard and strong surface. It is a system that reinforces mortar with metal.\n"}, {"que": [["span", "The compression in PSC is done by _________ of high-strength tendons."]], "options": [[["span", "Compression"]], [["span", "Tensioning"]], [["span", "Shearing"]], [["span", "Bending"]]], "ans": "B", "explanation": "\nTensioning of high-strength tendons is used for the compression in pre-stressing concrete.\n"}, {"que": [["span", "In an R.C.C structure, the tension zone lies in the:"]], "options": [[["span", "Top"]], [["span", "Middle"]], [["span", "Side"]], [["span", "Bottom"]]], "ans": "D", "explanation": "\nThe bottom is the region where the tension zone lies in a RCC. There is a neutral axis in the middle with no compression and tension.\n"}, {"que": [["span", "R.C.C. was developed and first used by:"]], "options": [[["span", "Joseph Monier"]], [["span", "John Smeaton"]], [["span", "Francois Coignet"]], [["span", "Joseph Asphadin"]]], "ans": "C", "explanation": "\nFrancois Coignet, a french industrialist developed and first used the RCC. Joseph Monier founded ferro-cement. John Smeaton is considered the father of Civil Engineering. Joseph Asphdin founded Portland cement.\n"}, {"que": [["span", "Which of the below structure doesn’t require PSC?"]], "options": [[["span", "Bridge"]], [["span", "Arch "]], [["span", "Dam"]], [["span", "Silos"]]], "ans": "B", "explanation": "\nAll other structures except arches carry heavy loads and hence require PSC to be efficient. Arches are not under so much compression and loading.\n"}, {"que": [["span", "How many methods of ferro cementing are there?"]], "options": [[["span", "3"]], [["span", "2"]], [["span", "4"]], [["span", "6"]]], "ans": "A", "explanation": "\nThere are 3 methods of ferro cementing. Armature system, closed mould system and integrated mould system are the names.\n"}, {"que": [["span", "In which beam tension capacity of steel is greater than combined compression capacity of steel and concrete?"]], "options": [[["span", "Over-reinforced"]], [["span", "Under-reinforced"]], [["span", "Singly reinforced"]], [["span", "Doubly reinforced"]]], "ans": "A", "explanation": "\nIn over-reinforced beam the tension capacity is greater than combined compression capacity of steel and concrete.\n"}, {"que": [["span", "In a PSC, the tensioning system may be classified into:"]], "options": [[["span", "3"]], [["span", "2"]], [["span", "5"]], [["span", "4"]]], "ans": "B", "explanation": "\nThe tensioning system can be classified into 2 types i.e., mono-strand and multi-strand. In mono-strand, only one strand is tensioned at a time. In multi-strand, multiple strands are tensioned simultaneously.\n"}, {"que": [["span", "Which of the below is not a property of ferro cement?"]], "options": [[["span", "Impervious nature"]], [["span", "Capacity to resist shock"]], [["span", "No need of formwork"]], [["span", "Strength per unit mass is low"]]], "ans": "D", "explanation": "\nStrength per unit mass of ferro cement is higher than R.C.C. Tension resisting property is better in ferro cement.\n"}, {"que": [["span", "In a white wash, after how many hours is dissolved gum added to the solution?"]], "options": [[["span", "24 hours"]], [["span", "12 hours"]], [["span", "6 hours"]], [["span", "1 hour"]]], "ans": "A", "explanation": "\nDissolveed gum is added to the drum of white wash prepared from a fat lime 24 hours after the white wash is put inside the drum.\n"}, {"que": [["span", "_________ are cheaper varieties of paint."]], "options": [[["span", "Colour wash"]], [["span", "Pointing"]], [["span", "Distempers"]], [["span", "Acrylics"]]], "ans": "C", "explanation": "\nDisempters are cheaper varieties of paint. They have chalk as a base, water as a carrier and emulsifying agents like glue or casein.\n"}, {"que": [["span", "A paint normally consists of _________ components."]], "options": [[["span", "3"]], [["span", "5"]], [["span", "4"]], [["span", "6"]]], "ans": "D", "explanation": "\nBase, vehicle, solvent, pigment, filter and drier are the six components in a paint.\n"}, {"que": [["span", "_________ paint gets deteriorated when exposed to sun."]], "options": [[["span", "Asbestos"]], [["span", "Bituminous"]], [["span", "Oil"]], [["span", "Aluminium"]]], "ans": "B", "explanation": "\nBituminous paint applied on iron which is made by dissolving asphalt and bitumen in oil or petroleum gets deteriorated when exposed to sun.\n"}, {"que": [["span", "The appearance of glossy patches on the painted surface is called:"]], "options": [[["span", "Flashing"]], [["span", "Blooming"]], [["span", "Running"]], [["span", "Blistering"]]], "ans": "A", "explanation": "\nFlashing is the appearance of glossy patches on the painted surface. It is caused due to poor quality of paint.\n"}, {"que": [["span", "Which of the below is a pigment imparting brown colour?"]], "options": [[["span", "Raw Sienna"]], [["span", "Soot"]], [["span", "Burnt Sienna"]], [["span", "Ultramarine"]]], "ans": "C", "explanation": "\nBurnt Sienna imparts brown colour to paint. Raw sienna, soot and ultramarine imparts yellow, black and blue colour respectively to paint.\n"}, {"que": [["span", "The component filler in paint does the function of:"]], "options": [[["span", "Absorbing oxygen"]], [["span", "Reducing cost"]], [["span", "Consistency"]], [["span", "Smooth Spreading"]]], "ans": "B", "explanation": "\nTo reduce the cost of paint, fillers are added. If used too much it can weaken the paint. Alumina, magnesia, barite, charcoal, etc are examples of filler.\n "}, {"que": [["span", "Saponification is a defect on the painted surface and it is identified by the appearance of:"]], "options": [[["span", "Wrinkles"]], [["span", "Dull patches"]], [["span", "Bubbles"]], [["span", "Soapy patches"]]], "ans": "D", "explanation": "\nSoapy patches appear on the painted surface due to chemical reaction of alkalis. This defect is called Saponification.\n"}, {"que": [["span", "Which of the below is not an example of a base?"]], "options": [[["span", "White lead"]], [["span", "Cobalt"]], [["span", "Zinc oxide "]], [["span", "Red lead"]]], "ans": "B", "explanation": "\nCobalt is not a base instead it is a drier. It is used to absorb oxygen from surroundings and harden the paints.\n"}, {"que": [["span", "Which paint contains polystyrene as a base?"]], "options": [[["span", "Synthetic rubber"]], [["span", "Enamel"]], [["span", "Aluminium"]], [["span", "Emulsion"]]], "ans": "D", "explanation": "\nEmulsion paints have polystrene as a base. Emulsion paints are durable and can retain colour for too long. They dry within 15 minutes and hard dry within 2 hours.\n"}, {"que": [["span", "Which defect occurs if a paint is applied excessively thick?"]], "options": [[["span", "Grinning"]], [["span", "Running"]], [["span", "Wrinkling"]], [["span", "Flaking"]]], "ans": "C", "explanation": "\nIf a paint is applied excessively thick then wrinkling occurs. Grinning occurs when under coat and final coat are of different colours. Running occurs if the surface is too smooth; paint run off from such parts. Flaking occurs due to poor adhesion, leading to peeling off of paint.\n"}, {"que": [["span", "In prestressed concrete structures the primary problem is damaged caused to ____________"]], "options": [[["span", "Bridge decks"]], [["span", "Spans"]], [["span", "Anchorages"]], [["span", "Ridges"]]], "ans": "C", "explanation": "\n The Damage caused to anchorages and unbounded tendons are the primary problems in prestressed concrete structures. Good maintenance includes periodical surveillance identification of local damage, deterioration and loss of durability of the structure due to environmental and other load effects.\n"}, {"que": [["span", "Rehabilitation of structures may be required due to several reasons. Choose the correct reason."]], "options": [[["span", "Environmental effects"]], [["span", "Tensile effects"]], [["span", "Compressive effects"]], [["span", "Range effects"]]], "ans": "A", "explanation": "\nEnvironmental effects are one of the reason why rehabilitation of structures may be required. Other reasons may be constructional deficiency, deficiency in design, overloading of structures either due to unanticipated loading or due to accidents and user made changes in the structures during the service life of the structure.\n"}, {"que": [["span", "What is the problem of rehabilitation?"]], "options": [[["span", "Unique"]], [["span", "Submerged"]], [["span", "Lined"]], [["span", "Layered"]]], "ans": "A", "explanation": "\nThe use of common techniques for rehabilitation of various structures is limited because the problem of rehabilitation is unique for the particular structure. Several new cementations materials and epoxy resigns and compounds have been developed which are highly effective in protecting the basic structure from the destructive effects of severe exposure conditions in the environment.\n"}, {"que": [["span", "Maintaining prestressed concrete structures of various types in a fit and serviceable condition is primary function of ____________"]], "options": [[["span", "Maintenance engineer"]], [["span", "Design engineer"]], [["span", "Surface engineer"]], [["span", "Structural engineer"]]], "ans": "A", "explanation": "\nMaintenance engineer has the primary function of maintaining prestressed concrete structures of various types in a fit and serviceable condition. Investment towards effective periodical maintenance forms only a fraction of the cost to be incurred due to major repairs to rehabilitate the structures and hence it is always advisable to establish a programmed preventive maintenance system to detect any signs of distress in the initial stages itself through inspection procedures and appropriate repairs.\n"}, {"que": [["span", "The structural concrete slab panels can be repaired by ____________"]], "options": [[["span", "Internal bonding"]], [["span", "External bonding"]], [["span", "Stress bonding"]], [["span", "Layered bonding"]]], "ans": "B", "explanation": "\nThe structural concrete slab panels can be repaired by external bonding of steel plates to the soffit by using epoxy adhesives and hollows.\n"}, {"que": [["span", "Which type of inspection is more intensive involving examination of structural elements?"]], "options": [[["span", "Minor inspection"]], [["span", "General inspection"]], [["span", "Major inspection"]], [["span", "Reverse inspection"]]], "ans": "C", "explanation": "\nThe inspection more intensive involving examination of structural elements is Major inspection. It even require setting up of special access facilities where required depending upon the importance of the structure. This inspection is generally spaced between 2 and 3 years.\n"}, {"que": [["span", "Prestressed concrete structures showing visible signs of distress in the form of ____________"]], "options": [[["span", "Surface cracks"]], [["span", "Patterns "]], [["span", "Patches"]], [["span", "None of the mentioned"]]], "ans": "A", "explanation": "\nIn the form of surface cracks prestressed concrete structures shows visible signs of distress. Spalling of concrete should be special inspection using instruments to users the extent of damage to the structure.\n"}, {"que": [["span", "One of the testing equipments used for inspection is?"]], "options": [[["span", "Strain gauges"]], [["span", "Measuring jar"]], [["span", "Test tubes"]], [["span", "None of the mentioned"]]], "ans": "A", "explanation": "\nStrain gauges is one of the testing equipments used for inspection. Modern testing equipments which could be of use to the specialized inspection team are listed below:\nRebound hammer compressive strength (Schmidt hammer), ultrasonic pulse velocity detection of cracks, snooper-crawler and adjustable ladders, magnetic decor for measuring thickness of concrete cover and for locating reinforcement bars, mechanical extensometer, transparent templates and microscope for reading of crack widths on the surface of the concrete hydraulic jacks, pressure transducers or load cells for measurement of forces etc, electronic strain gauges for measurement of strain in concrete and steel, vibration measuring equipment, electrical resistance meter(for rust pockets).\n"}, {"que": [["span", "The pachometer is used to locate the ____________"]], "options": [[["span", "Steel reinforcement"]], [["span", "Aluminium reinforcement"]], [["span", "Tensile reinforcement"]], [["span", "Surface reinforcement"]]], "ans": "A", "explanation": "\nThe pachometer is used to locate the Steel reinforcement. A wide variety of electronic equipment is presently available in the market in many countries for monitoring and inspection of distress in different types of structures and ultrasonic meters are used to determine the degree of deterioration and distress and / or material imperfections that are relevant to the structural integrity of the structure to be inspected and pachometer is used to locate the steel reinforcements and measures the sizes of the bars embedded in concrete to an accuracy of 3m.\n"}, {"que": [["span", "In case of bridge greater than 10.7m in height and which cannot be inspected from beneath due to watery situation the instrument suited for inspection work is?"]], "options": [[["span", "Electrical resistance meter"]], [["span", "Strain gauges"]], [["span", "Barins snooper vehicle"]], [["span", "Rain guages"]]], "ans": "C", "explanation": "\nBarins snooper vehicle is used to inspect in case of bridge greater than 10.7m in height and which cannot be inspected from beneath due to watery situation. The snooper is mounted on a heavy duty truck with a swiveling platform and the underside of the bridge deck can be inspected by using the hydraulically operated platform.\n"}, {"que": [["span", "In the case of dormant cracks wider than about 1m, it is more economical to use ____________"]], "options": [[["span", "Epoxy resin"]], [["span", "Grouting"]], [["span", "Tensioning"]], [["span", "Ranging"]]], "ans": "B", "explanation": "\nIn the case of dormant cracks wider than about 1m, it is more economical to use grouting and sealing technique. This method involves enlarging the crack along its exposed face and then the crack is cleaned and grouted and the surface is then sealed with a suitable joint sealant and various other techniques widely used for repair of dormant or dead cracks include dry packing, polymer impregnation over lays and surface treatments and autogenous handling.\n"}, {"que": [["span", "How many sealants are there used depending upon their suitability in a given situation?"]], "options": [[["span", "3"]], [["span", "2"]], [["span", "4"]], [["span", "1"]]], "ans": "A", "explanation": "\nThree types of sealants are used depending upon their suitability in a given situation. They are: Mastics are asphalts with a low melting point with added fillers or fibers and they are recommended where the total movements will not exceed 15 percent of the width of groove, Thermoplastics comprising of asphalts, pitches and coal tar become liquid or semi viscous when heated and the groove depth to width ratio should 1:1 and the total design movement is of order of 25 percent of groove width and Elastomers include a wide range of materials such as poly sulphides, epoxy poly sulphides, poly urethane, silicones and acrylics and these materials advantages since they can be used without heating.\n"}, {"que": [["span", "How many types of damages are present in classification of damage?"]], "options": [[["span", "1"]], [["span", "2"]], [["span", "3"]], [["span", "4"]]], "ans": "C", "explanation": "\nThere are three types of damages present. These are minor damage, moderate damage and several damage. Minor damage requires superficial patching by using epoxy grout or guniting using Shortcrete and the damages and delaminated concrete is removed by hand tools and the surface is cleaned before the application of epoxy grout, moderate damage involves extensive spalling and cracking of concrete is generally applicable as in minor repairs and in Several damage Prestressed concrete girders requires a detailed structural analysis of a design check based on the conditions of the damage and the best engineering assumptions and judgments.\n"}, {"que": [["span", "If the loss of prestress is excessive resulting in tensile cracks, which method should be used?"]], "options": [[["span", "Preloading method"]], [["span", "Hollow method"]], [["span", "Transparent method"]], [["span", "Layered method"]]], "ans": "A", "explanation": "\nPreloading methods should be considered in making concrete repairs if the loss of prestress is excessive resulting in tensile cracks. This is done in order to restore the equivalent full or partial prestress effect, as per original designs.\n"}, {"que": [["span", "The repair and rehabilitation of damaged or spalled concrete is done by removing the ____________"]], "options": [[["span", "Loose concrete"]], [["span", "Collapsing"]], [["span", "Breakage "]], [["span", "Bonding"]]], "ans": "A", "explanation": "\nBy removing the loose concrete, the repair and rehabilitation of damaged or spalled concrete is done. Temporary support is provided to the girder to relieve dead load stresses and the case of pretressed concrete bridge decks, special stress check up is essential before starting the repair works.\n"}, {"que": [["span", "In many cases of heavily loaded girders, shear distress is observed near the ____________"]], "options": [[["span", "Edges"]], [["span", "Supports"]], [["span", "Span"]], [["span", "Length"]]], "ans": "B", "explanation": "\nIn the form of diagonal tension cracks and shear cracks, shear distress is observed near the supports in many cases of heavily loaded girders. Tension cracks and shear cracks may arise due to improper detailing or compaction of concrete near the support zone in such cases holes are drilled diagonally and rebars are placed and grouted to arrest the shear cracks.\n"}, {"que": [["span", "Bridge girders located in zones of very severe exposure conditions suffer ____________"]], "options": [[["span", "Spalling"]], [["span", "Bleeding"]], [["span", "Winding"]], [["span", "Spinning"]]], "ans": "A", "explanation": "\nBridge girders located in zones of very severe exposure conditions suffer spalling. extensive spalling of concrete exposing the reinforcements and in such cases the unsound or loose concrete around the girders is removed and repairing against the loss of concrete section is done by jacketing the girders using a steel form.\n"}, {"que": [["span", "The crack propagation in the concrete girders can be arrested by using the principles of ____________"]], "options": [[["span", "Pre tensioning"]], [["span", "Post tensioning"]], [["span", "Prestressing"]], [["span", "Loading"]]], "ans": "B", "explanation": "\nCrack propagation in the concrete girders can be arrested by the principles of post tensioning and tensile cracking in the girder are arrested by including compression using tension ties forced to the sides of the girder at locations of tensile cracks.\n"}, {"que": [["span", "In some cases of repairs of girders damaged by collision, the damage is severe what is used?"]], "options": [[["span", "Trusses and bars"]], [["span", "Struts and pins"]], [["span", "Links and dowels"]], [["span", "Lace and anchores"]]], "ans": "C", "explanation": "\nLinks and dowels are used in some cases of repairs of girders damaged by collision when the damage is severe. Links and dowels are used along with wire mesh tied to the reinforcements and the entire damaged part is repaired using mortar or non shrink grout.\n"}, {"que": [["span", "The corrosion of reinforcement due to extreme exposure is common for structure located in ____________"]], "options": [[["span", "Dry conditions"]], [["span", "Costal zones"]], [["span", "Regional zones"]], [["span", "Hot condition"]]], "ans": "B", "explanation": "\nThe corrosion of reinforcement due to extreme exposure is common for structure located in costal zones. The high tensile strands may get damaged resulting in loss of prestresss in the girder.\n"}, {"que": [["span", "In case of damaged prestressed concrete I girders which are used for restoring strength?"]], "options": [[["span", "Pretensioning"]], [["span", "Post tensioning"]], [["span", "Chemicals"]], [["span", "Dies"]]], "ans": "B", "explanation": "\nPost tensioning rods in conjugation with jacking can be used for restoring strength in case of damaged prestressed concrete I girders.\n"}, {"que": [["span", "In restoration of strength by adding external reinforced concrete the damages concrete is first repaired by applying ____________"]], "options": [[["span", "Preload"]], [["span", "Tensile load"]], [["span", "Compressive load"]], [["span", "Overload"]]], "ans": "A", "explanation": "\nIn restoration of strength by adding external reinforced concrete the damages concrete is first repaired by applying preload and the concrete a corbels are constructed with the required conventional steel reinforcement and it shows adding external reinforcement concrete to restore the strength of the damaged girder.\n"}, {"que": [["span", "In method 3 the restoration is done by addition of ____________"]], "options": [[["span", "Metal sleeve jacket"]], [["span", "Aluminium jacket"]], [["span", "Steel jacket"]], [["span", "Water proof jacket"]]], "ans": "A", "explanation": "\nMetal sleeve jacket is added in method 3 to do the restoration. In this method preload is applied before the repair of the damaged concrete and removed after the completion of repairs and a metal sleeve jacket is installed around and beyond the damaged area and the gap between the metal sleeve girders is filles with epoxy grout by pressure injection.\n"}]]